src/test/resources/templates/smartpay/valid-capture-smartpay-request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <ns1:capture xmlns:ns1="http://payment.services.adyen.com">
            <ns1:modificationRequest>
                <merchantAccount xmlns="http://payment.services.adyen.com">MerchantAccount</merchantAccount>
                <modificationAmount xmlns="http://payment.services.adyen.com">
                    <currency xmlns="http://common.services.adyen.com">GBP</currency>
                    <value xmlns="http://common.services.adyen.com">2000</value>
                </modificationAmount>
                <originalReference xmlns="http://payment.services.adyen.com">MyTransactionId</originalReference>
            </ns1:modificationRequest>
        </ns1:capture>
    </soap:Body>
</soap:Envelope>

